app/Models/EventModel.php

INSERT INTO `events` (`festival_id`, `event_name`, `event_logo`, `start_date`, `end_date`, `country`, `state`, `city`, `latitude`, `longitude`, `event_description`, `event_participant_limit`, `event_highlights`) VALUES ('null', 'dagdlgikua', 'uploads/logos/dagdlgikua_logo_2025.png', '2025-04-02 00:00:00', '2025-04-02 04:14:03', 'AF', 'BDS', 'Ashkāsham', '10.3157', '123.8854', 'asdasdawdsdaw', '100', '[]')
---
    public function createEvent(array $data)
    {
        if (isset($data['event_highlights']) && is_array($data['event_highlights'])) {
            $data['event_highlights'] = json_encode($data['event_highlights']);
        }

        return $this->insert($data, true);