app/Models/FestivalModel.php

    public function insertFestival(array $data)
    {
        $data['festival_highlights'] = json_encode($data['festival_highlights'] ?? []);
        return $this->insert($data);
---
INSERT INTO `festivals` (`festival_name`, `festival_logo`, `date`, `country`, `state`, `city`, `festival_description`, `festival_highlights`) VALUES ('dasdw', 'uploads/logos/dasdw_logo_2025.png', '2025-04-15', 'AF', 'BDS', 'Ashkāsham', 'dasdawdsa', '[]')