app/Models/OrganizerModel.php

INSERT INTO `organizers` (`festival_id`, `user_name`)
VALUES (4,'null'), (4,'das')
---
    public function addFestivalOrganizers(int $festivalId, array $userNames)
    {
        $data = array_map(fn($name) => [
            'festival_id' => $festivalId,
            'user_name' => $name,
        ], $userNames);

        return $this->insertBatch($data);

INSERT INTO `organizers` (`event_id`, `user_name`)
VALUES (1,'dsdsd'), (1,'Duka Na')
---
    public function addEventOrganizers(int $eventId, array $userNames)
    {
        $data = array_map(fn($name) => [
            'event_id' => $eventId,
            'user_name' => $name,
        ], $userNames);

        return $this->insertBatch($data);