app/Models/UserModel.php

    public function createUser($data)
    {
        if (!$this->validate($data)) {
            return ['success' => false, 'errors' => $this->errors()];
        }

        $this->insert($data);
---
INSERT INTO `user` (`user_name`, `password`, `full_name`, `email`, `country`, `city`) VALUES ('anton211', '$2y$10$E5Jqz1Mh2kURE33jhp2inOxWrXFjkLbIE/TMf01C31SCsOmUwrAiC', 'Anton Neil Andalesy123', 'jklgiujk1234@gmail.com', 'KP', 'Pyongyang')

    public function getUserByUsername($userName)
    {
        return $this->where('user_name', $userName)->first();
---
SELECT *
FROM `user`
WHERE `user_name` = 'rheam'
 LIMIT 1

    public function getUsernames($search = null)
    {
        $builder = $this->select('user_name');

        if ($search) {
            $builder->like('user_name', $search);
        }

        return $builder->findAll();
---
SELECT `user_name`
FROM `user`
WHERE `user_name` LIKE '%sa%' ESCAPE '!'